<template>
  <div>
    <h4>
      説明書
      <small class="text-muted">usage</small>
    </h4>
    <dl class="row">
      <dt class="col-sm-2">概要</dt>
      <dd class="col-sm-10">
        複数人がリアルタイムで同じ将棋盤を表示・操作できるWebアプリケーションです。
        ちょっとした自由対局や感想戦、研究会などにお使いいただけます。
      </dd>
      <dt class="col-sm-2">ルーム作成</dt>
      <dd class="col-sm-10">
        任意のルームIDを入力してください。盤面はルーム（URL）単位で同期されます。
        入力したルームIDはそのままURLに使われるため、半角英数字を推奨します。
      </dd>
      <dt class="col-sm-2">オプション</dt>
      <dd class="col-sm-10">
        オプションとして、「最終着手位置（オレンジ色）の表示」「符号ガイドの表示」
        「駒音の有無」「駒のフォント」を設定することができます。
        （白抜き状態がONです。）（入室後も変更できます。）
        トップページで設定したオプション情報はURLに追加されるため、
        オプションの初期状態を共有することができます。
      </dd>
      <dt class="col-sm-2">URL共有</dt>
      <dd class="col-sm-10">
        URLをコピーして、盤面を共有したい人に伝えてください。
        直接ルームに入ることができます。（ユーザー認証はありません）
      </dd>
      <dt class="col-sm-2">盤面の同期</dt>
      <dd class="col-sm-10">
        誰かが駒を動かすと、同じURLを表示しているすべての人の盤面が自動で更新されます。
        （盤面単位で同期されるため、同時に動かすと直前の動作が上書きされる場合があります。）
      </dd>
      <dt class="col-sm-2">盤面の保存</dt>
      <dd class="col-sm-10">
        サーバーには現在局面のみが保存されます。ルームIDに紐づけて保存され、半永久的に残ります（メンテナンスによって削除される場合があります）。
        操作履歴はブラウザに一時的に保存され、「一手戻す」「一手進む」ボタンで移動できます（ページ再読み込みで削除されます）。
      </dd>
      <dt class="col-sm-2">盤面の操作</dt>
      <dd class="col-sm-10">
        クリックとドラッグ＆ドロップの両方に対応しています。
        駒の動きはチェックしていないため、自由に動かすことができます。
      </dd>
      <dt class="col-sm-2">駒の成り方</dt>
      <dd class="col-sm-10">
        PCの場合は右クリックで成れます。
        タブレット等の場合、駒をタップして選択状態（黄色背景）にしてから下部のボタンを押してください。
      </dd>
      <dt class="col-sm-2">問い合わせ</dt>
      <dd class="col-sm-10">
        Twitterでサポートを行っています。不明点などがありましたら、
        <a href="https://twitter.com/shogiwebroom">@shogiwebroom</a>
        までご連絡ください。
      </dd>
    </dl>
  </div>
</template>

<style>
</style>